Pandas Exercises: Student Dataset

1. Inspect the Data

In [1]:
import kagglehub
import os 
import pandas as pd
# Download latest version
path = kagglehub.dataset_download("ayeshaimran123/data-science-student-marks")

file_path = os.path.join(path, 'data_science_student_marks.csv')
df = pd.read_csv(file_path)

df

,student_id,location,age,sql_marks,excel_marks,python_marks,power_bi_marks,english_marks
0,4,Sydney,24,95,99,87,82,75
1,5,Tokyo,24,99,95,89,86,82
2,6,Berlin,22,72,70,99,79,77
3,7,London,23,97,90,74,72,85
4,8,Tokyo,22,91,71,79,80,75
...,...,...,...,...,...,...,...,...
492,496,New York,23,71,92,98,78,88
493,497,Los Angeles,20,90,100,90,78,73
494,498,Paris,22,78,80,78,71,70
495,499,Los Angeles,21,96,93,78,78,82
496,500,London,22,85,87,93,70,86

In [2]:
#print the first 10 rows of the dataset:
df.head(10)

,student_id,location,age,sql_marks,excel_marks,python_marks,power_bi_marks,english_marks
0,4,Sydney,24,95,99,87,82,75
1,5,Tokyo,24,99,95,89,86,82
2,6,Berlin,22,72,70,99,79,77
3,7,London,23,97,90,74,72,85
4,8,Tokyo,22,91,71,79,80,75
5,9,Toronto,20,93,88,75,93,72
6,10,Tokyo,18,77,87,100,98,93
7,11,Toronto,21,78,90,88,79,72
8,12,Melbourne,24,80,95,87,90,94
9,13,London,19,97,80,96,97,86

In [3]:
df.tail() ## print last 5 rows of the dat

,student_id,location,age,sql_marks,excel_marks,python_marks,power_bi_marks,english_marks
492,496,New York,23,71,92,98,78,88
493,497,Los Angeles,20,90,100,90,78,73
494,498,Paris,22,78,80,78,71,70
495,499,Los Angeles,21,96,93,78,78,82
496,500,London,22,85,87,93,70,86

In [4]:
df.info #Display info

<bound method DataFrame.info of      student_id     location  age  sql_marks  excel_marks  python_marks  \
0             4       Sydney   24         95           99            87
1             5        Tokyo   24         99           95            89
2             6       Berlin   22         72           70            99
3             7       London   23         97           90            74
4             8        Tokyo   22         91           71            79
..          ...          ...  ...        ...          ...           ...
492         496     New York   23         71           92            98
493         497  Los Angeles   20         90          100            90
494         498        Paris   22         78           80            78
495         499  Los Angeles   21         96           93            78
496         500       London   22         85           87            93

     power_bi_marks  english_marks
0                82             75
1                86             82
2                79             77
3                72             85
4                80             75
..              ...            ...
492              78             88
493              78             73
494              71             70
495              78             82
496              70             86

[497 rows x 8 columns]>

In [5]:
df.shape #Display shape

(497, 8)

In [6]:
df.columns #Display column names

Index(['student_id', 'location', 'age', 'sql_marks', 'excel_marks',
       'python_marks', 'power_bi_marks', 'english_marks'],
      dtype='object')

-----------------------------------------------------------------------------------------------------------------------

2. Selecting Columns and Rows

In [7]:
#Display only the location and python_marks
df[['location','python_marks']]

        location  python_marks
0         Sydney            87
1          Tokyo            89
2         Berlin            99
3         London            74
4          Tokyo            79
..           ...           ...
492     New York            98
493  Los Angeles            90
494        Paris            78
495  Los Angeles            78
496       London            93

[497 rows x 2 columns]

In [8]:
# Display the first rows of sql_marks and excel_marks
df.iloc[:5,[3,4]]

   sql_marks  excel_marks
0         95           99
1         99           95
2         72           70
3         97           90
4         91           71

In [9]:
#Select the row for student_id 10
df.loc[df['student_id'] == 10]

,student_id,location,age,sql_marks,excel_marks,python_marks,power_bi_marks,english_marks
6,10,Tokyo,18,77,87,100,98,93

In [11]:
(df.sort_values(by='student_id', ascending=True)).head(10)

,student_id,location,age,sql_marks,excel_marks,python_marks,power_bi_marks,english_marks
0,4,Sydney,24,95,99,87,82,75
1,5,Tokyo,24,99,95,89,86,82
2,6,Berlin,22,72,70,99,79,77
3,7,London,23,97,90,74,72,85
4,8,Tokyo,22,91,71,79,80,75
5,9,Toronto,20,93,88,75,93,72
6,10,Tokyo,18,77,87,100,98,93
7,11,Toronto,21,78,90,88,79,72
8,12,Melbourne,24,80,95,87,90,94
9,13,London,19,97,80,96,97,86

In [10]:
#Select the row for student_id 10
df[df['student_id'] == 10]

,student_id,location,age,sql_marks,excel_marks,python_marks,power_bi_marks,english_marks
6,10,Tokyo,18,77,87,100,98,93

-----------------------------------------------------------------------------------------------------------------------

3.Filtering Rows

In [17]:
#Find all students who scored more than 90 in Python
high_python = df[df["python_marks"] > 90]
high_python

,student_id,location,age,sql_marks,excel_marks,python_marks,power_bi_marks,english_marks
2,6,Berlin,22,72,70,99,79,77
6,10,Tokyo,18,77,87,100,98,93
9,13,London,19,97,80,96,97,86
14,18,Melbourne,19,89,76,96,93,71
18,22,Los Angeles,22,83,73,100,75,85
...,...,...,...,...,...,...,...,...
481,485,Paris,21,89,98,96,83,79
484,488,Berlin,21,88,94,94,77,81
486,490,Tokyo,18,87,100,95,89,85
492,496,New York,23,71,92,98,78,88
496,500,London,22,85,87,93,70,86

In [18]:
#Find students located in Tokyo with sql_marks > 90.
tokyo_sql = df[(df["location"] == "Tokyo") & (df["sql_marks"] > 90)]
tokyo_sql

,student_id,location,age,sql_marks,excel_marks,python_marks,power_bi_marks,english_marks
1,5,Tokyo,24,99,95,89,86,82
4,8,Tokyo,22,91,71,79,80,75
33,37,Tokyo,23,98,94,77,83,92
58,62,Tokyo,24,92,78,89,79,86
79,83,Tokyo,19,96,82,89,75,84
89,93,Tokyo,25,98,80,89,80,100
167,171,Tokyo,20,97,90,85,77,74
220,224,Tokyo,18,95,81,72,83,90
320,324,Tokyo,19,97,94,90,94,82
367,371,Tokyo,23,97,91,94,75,77
379,383,Tokyo,25,99,83,79,83,95
383,387,Tokyo,19,93,96,77,100,98
406,410,Tokyo,25,93,99,81,76,73
420,424,Tokyo,20,92,87,92,81,84
467,471,Tokyo,22,94,71,84,87,70
474,478,Tokyo,21,98,89,94,75,97

In [19]:
#Find students whose age is 22 or 23.
student_age= df[(df["age"] == 22) | (df["age"] == 23)]
student_age

,student_id,location,age,sql_marks,excel_marks,python_marks,power_bi_marks,english_marks
2,6,Berlin,22,72,70,99,79,77
3,7,London,23,97,90,74,72,85
4,8,Tokyo,22,91,71,79,80,75
15,19,Paris,22,72,92,70,82,83
18,22,Los Angeles,22,83,73,100,75,85
...,...,...,...,...,...,...,...,...
475,479,London,23,81,91,93,81,75
488,492,London,23,85,73,78,81,96
492,496,New York,23,71,92,98,78,88
494,498,Paris,22,78,80,78,71,70
496,500,London,22,85,87,93,70,86

In [20]:
# Find students who scored more than 80 in Python or more than 90 in Excel.
names = df[(df["python_marks"] > 80) | (df["excel_marks"] > 90)][["student_id"]]
names

     student_id
0             4
1             5
2             6
6            10
7            11
..          ...
491         495
492         496
493         497
495         499
496         500

[387 rows x 1 columns]

-----------------------------------------------------------------------------------------------------------------------

4. Using 
.isin() , 
.between() , 
.str

In [21]:
#Select students located in London, Sydney, or Berlin.
names = df[df["location"].isin(["London", "Sydney", "Berlin"])][["student_id"]]
names

     student_id
0             4
2             6
3             7
9            13
16           20
..          ...
476         480
477         481
484         488
488         492
496         500

[151 rows x 1 columns]

In [22]:
#Select students with age between 21 and 24.
students_age = df[df["age"].between(21, 24)]
students_age

,student_id,location,age,sql_marks,excel_marks,python_marks,power_bi_marks,english_marks
0,4,Sydney,24,95,99,87,82,75
1,5,Tokyo,24,99,95,89,86,82
2,6,Berlin,22,72,70,99,79,77
3,7,London,23,97,90,74,72,85
4,8,Tokyo,22,91,71,79,80,75
...,...,...,...,...,...,...,...,...
491,495,New York,24,83,78,82,84,84
492,496,New York,23,71,92,98,78,88
494,498,Paris,22,78,80,78,71,70
495,499,Los Angeles,21,96,93,78,78,82
496,500,London,22,85,87,93,70,86

-----------------------------------------------------------------------------------------------------------------------

5. Sorting

In [23]:
#Sort students by python_marks descending.
sorted_students = df.sort_values(by="python_marks", ascending=False)
sorted_students

,student_id,location,age,sql_marks,excel_marks,python_marks,power_bi_marks,english_marks
18,22,Los Angeles,22,83,73,100,75,85
369,373,Sydney,19,81,83,100,74,72
123,127,Sydney,23,71,72,100,91,95
311,315,London,23,100,77,100,81,70
154,158,Sydney,23,82,100,100,98,75
...,...,...,...,...,...,...,...,...
371,375,Toronto,22,78,72,70,86,77
194,198,Melbourne,24,94,72,70,98,86
438,442,Berlin,18,89,79,70,93,76
431,435,Los Angeles,19,70,78,70,71,70
53,57,Sydney,25,87,89,70,83,71

In [24]:
#Sort by location ascending and sql_marks descending.
sorted_df = df.sort_values(by=["location", "sql_marks"], ascending=[True, False])
sorted_df

,student_id,location,age,sql_marks,excel_marks,python_marks,power_bi_marks,english_marks
34,38,Berlin,21,100,95,78,73,77
85,89,Berlin,20,99,85,86,86,80
333,337,Berlin,19,98,81,88,71,70
155,159,Berlin,25,97,82,84,88,99
205,209,Berlin,23,95,78,74,96,88
...,...,...,...,...,...,...,...,...
201,205,Toronto,19,73,85,95,96,87
148,152,Toronto,18,72,84,82,71,79
237,241,Toronto,19,72,75,95,71,80
239,243,Toronto,24,72,86,93,72,80
452,456,Toronto,23,71,80,82,75,96

In [25]:
#Sort the DataFrame by age ascending, then english_marks descending.
sorted_df1 = df.sort_values(by=["age", "english_marks"], ascending=[True, False])
sorted_df1

,student_id,location,age,sql_marks,excel_marks,python_marks,power_bi_marks,english_marks
19,23,New York,18,80,73,94,89,100
203,207,Los Angeles,18,95,83,94,89,100
257,261,Melbourne,18,83,91,91,95,99
387,391,Sydney,18,85,76,71,86,99
389,393,Melbourne,18,78,90,97,99,99
...,...,...,...,...,...,...,...,...
483,487,Los Angeles,25,74,79,81,87,72
53,57,Sydney,25,87,89,70,83,71
356,360,Melbourne,25,99,86,100,90,71
381,385,Tokyo,25,87,70,92,91,71
68,72,Berlin,25,91,73,83,88,70

-----------------------------------------------------------------------------------------------------------------------

6. Adding / Modifying Columns

In [26]:
#Create a column total_marks which is the sum of all marks columns.
df["total_marks"] = df[["sql_marks", "excel_marks", "python_marks", "power_bi_marks", "english_marks"]].sum(axis=1)
df

,student_id,location,age,sql_marks,excel_marks,python_marks,power_bi_marks,english_marks,total_marks
0,4,Sydney,24,95,99,87,82,75,438
1,5,Tokyo,24,99,95,89,86,82,451
2,6,Berlin,22,72,70,99,79,77,397
3,7,London,23,97,90,74,72,85,418
4,8,Tokyo,22,91,71,79,80,75,396
...,...,...,...,...,...,...,...,...,...
492,496,New York,23,71,92,98,78,88,427
493,497,Los Angeles,20,90,100,90,78,73,431
494,498,Paris,22,78,80,78,71,70,377
495,499,Los Angeles,21,96,93,78,78,82,427
496,500,London,22,85,87,93,70,86,421

In [27]:
#Create a column average_marks which is the mean of all marks columns.
df["average_marks"] = df[["sql_marks", "excel_marks", "python_marks", "power_bi_marks", "english_marks"]].mean(axis=1)
df

,student_id,location,age,sql_marks,excel_marks,python_marks,power_bi_marks,english_marks,total_marks,average_marks
0,4,Sydney,24,95,99,87,82,75,438,87.6
1,5,Tokyo,24,99,95,89,86,82,451,90.2
2,6,Berlin,22,72,70,99,79,77,397,79.4
3,7,London,23,97,90,74,72,85,418,83.6
4,8,Tokyo,22,91,71,79,80,75,396,79.2
...,...,...,...,...,...,...,...,...,...,...
492,496,New York,23,71,92,98,78,88,427,85.4
493,497,Los Angeles,20,90,100,90,78,73,431,86.2
494,498,Paris,22,78,80,78,71,70,377,75.4
495,499,Los Angeles,21,96,93,78,78,82,427,85.4
496,500,London,22,85,87,93,70,86,421,84.2

In [28]:
#Create a column passed which is Yes if average_marks >= 75 else No .
import numpy as np
df["passed"] = np.where(df["average_marks"] >= 75, "Yes", "No")
df

,student_id,location,age,sql_marks,excel_marks,python_marks,power_bi_marks,english_marks,total_marks,average_marks,passed
0,4,Sydney,24,95,99,87,82,75,438,87.6,Yes
1,5,Tokyo,24,99,95,89,86,82,451,90.2,Yes
2,6,Berlin,22,72,70,99,79,77,397,79.4,Yes
3,7,London,23,97,90,74,72,85,418,83.6,Yes
4,8,Tokyo,22,91,71,79,80,75,396,79.2,Yes
...,...,...,...,...,...,...,...,...,...,...,...
492,496,New York,23,71,92,98,78,88,427,85.4,Yes
493,497,Los Angeles,20,90,100,90,78,73,431,86.2,Yes
494,498,Paris,22,78,80,78,71,70,377,75.4,Yes
495,499,Los Angeles,21,96,93,78,78,82,427,85.4,Yes
496,500,London,22,85,87,93,70,86,421,84.2,Yes

-----------------------------------------------------------------------------------------------------------------------

7. Dropping Columns and Rows

In [29]:
#Drop the column power_bi_marks 
df.drop(columns=['power_bi_marks'], inplace=True)
df

,student_id,location,age,sql_marks,excel_marks,python_marks,english_marks,total_marks,average_marks,passed
0,4,Sydney,24,95,99,87,75,438,87.6,Yes
1,5,Tokyo,24,99,95,89,82,451,90.2,Yes
2,6,Berlin,22,72,70,99,77,397,79.4,Yes
3,7,London,23,97,90,74,85,418,83.6,Yes
4,8,Tokyo,22,91,71,79,75,396,79.2,Yes
...,...,...,...,...,...,...,...,...,...,...
492,496,New York,23,71,92,98,88,427,85.4,Yes
493,497,Los Angeles,20,90,100,90,73,431,86.2,Yes
494,498,Paris,22,78,80,78,70,377,75.4,Yes
495,499,Los Angeles,21,96,93,78,82,427,85.4,Yes
496,500,London,22,85,87,93,86,421,84.2,Yes

In [30]:
#Drop the row for student_id 496.
df.drop(df[df["student_id"] == 496].index, inplace=True)
df

,student_id,location,age,sql_marks,excel_marks,python_marks,english_marks,total_marks,average_marks,passed
0,4,Sydney,24,95,99,87,75,438,87.6,Yes
1,5,Tokyo,24,99,95,89,82,451,90.2,Yes
2,6,Berlin,22,72,70,99,77,397,79.4,Yes
3,7,London,23,97,90,74,85,418,83.6,Yes
4,8,Tokyo,22,91,71,79,75,396,79.2,Yes
...,...,...,...,...,...,...,...,...,...,...
491,495,New York,24,83,78,82,84,411,82.2,Yes
493,497,Los Angeles,20,90,100,90,73,431,86.2,Yes
494,498,Paris,22,78,80,78,70,377,75.4,Yes
495,499,Los Angeles,21,96,93,78,82,427,85.4,Yes
496,500,London,22,85,87,93,86,421,84.2,Yes

In [31]:
#Drop the first 5 rows of the DataFrame.
df.drop(index=df.index[:5], inplace=True)
df

,student_id,location,age,sql_marks,excel_marks,python_marks,english_marks,total_marks,average_marks,passed
5,9,Toronto,20,93,88,75,72,421,84.2,Yes
6,10,Tokyo,18,77,87,100,93,455,91.0,Yes
7,11,Toronto,21,78,90,88,72,407,81.4,Yes
8,12,Melbourne,24,80,95,87,94,446,89.2,Yes
9,13,London,19,97,80,96,86,456,91.2,Yes
...,...,...,...,...,...,...,...,...,...,...
491,495,New York,24,83,78,82,84,411,82.2,Yes
493,497,Los Angeles,20,90,100,90,73,431,86.2,Yes
494,498,Paris,22,78,80,78,70,377,75.4,Yes
495,499,Los Angeles,21,96,93,78,82,427,85.4,Yes
496,500,London,22,85,87,93,86,421,84.2,Yes

-----------------------------------------------------------------------------------------------------------------------

8. Aggregation

In [32]:
#Calculate the average Python marks.
average_python = df["python_marks"].mean()
print("Average Python Marks:", average_python)

Average Python Marks: 85.36048879837067

In [33]:
#Find the maximum Excel marks
maximun_Excel = df["python_marks"].max()
print("Maximum Excel marks:", maximun_Excel)

Maximum Excel marks: 100

In [34]:
#Calculate the average total marks by location.
df.groupby('location')['total_marks'].mean()

location
Berlin         420.588235
London         428.022222
Los Angeles    423.116667
Melbourne      425.396552
New York       427.125000
Paris          422.945455
Sydney         425.557692
Tokyo          427.603448
Toronto        423.553571
Name: total_marks, dtype: float64

In [35]:
#Count how many students scored more than 90 in SQL.
count_sql = (df["sql_marks"] > 90).sum()

print("Number of students is:", count_sql)

Number of students is: 146

-----------------------------------------------------------------------------------------------------------------------

9. Using 
.loc and 
.iloc

In [36]:
# Select rows 10 to 20 and columns student_it to python_marks
subset = df.loc[10:20, "student_id":"python_marks"]
subset

    student_id     location  age  sql_marks  excel_marks  python_marks
10          14      Toronto   20         81           74            88
11          15        Paris   24         94           93            87
12          16        Tokyo   19         73           82            78
13          17        Tokyo   25         82           75            77
14          18    Melbourne   19         89           76            96
15          19        Paris   22         72           92            70
16          20       Berlin   25         92           87            81
17          21      Toronto   24         85           96            84
18          22  Los Angeles   22         83           73           100
19          23     New York   18         80           73            94
20          24       Berlin   20         74           85            96

In [37]:
#Update english_marks of student_id 5 to 85
df.loc[5, "english_marks"] = 85

update_english_marks = df.loc[[5], ["student_id", "english_marks"]]
update_english_marks

   student_id  english_marks
5           9             85

In [41]:
#select the 5th row,3rd column using .iloc
#iloc start from 0 
value = df.iloc[4, 2]
print("Value at 5th row, 3rd column:", value)

Value at 5th row, 3rd column: 19

-----------------------------------------------------------------------------------------------------------------------

10. Challenge: Combining Skills

In [43]:
#Find the top 5 students with highest average marks.
top5 = df.sort_values(by="average_marks", ascending=False).head(5)
top5

,student_id,location,age,sql_marks,excel_marks,python_marks,english_marks,total_marks,average_marks,passed
170,174,Melbourne,25,93,100,100,96,484,96.8,Yes
382,386,New York,19,94,91,99,99,468,93.6,Yes
234,238,Toronto,21,93,90,90,97,468,93.6,Yes
255,259,Paris,23,83,98,95,92,468,93.6,Yes
435,439,Berlin,21,92,99,96,88,467,93.4,Yes

In [44]:
#Find students from Los Angeles who scored more than 80 in all subjects.

marks_cols = ["sql_marks", "excel_marks", "python_marks", "english_marks"]

la_students = df[(df["location"] == "Los Angeles") & (df[marks_cols] > 80).all(axis=1)]

la_students

,student_id,location,age,sql_marks,excel_marks,python_marks,english_marks,total_marks,average_marks,passed
93,97,Los Angeles,18,82,99,95,87,433,86.6,Yes
126,130,Los Angeles,22,82,83,99,97,436,87.2,Yes
180,184,Los Angeles,25,99,88,96,90,463,92.6,Yes
203,207,Los Angeles,18,95,83,94,100,461,92.2,Yes
251,255,Los Angeles,19,88,83,99,99,451,90.2,Yes
253,257,Los Angeles,18,90,84,81,81,406,81.2,Yes
271,275,Los Angeles,22,87,87,97,89,435,87.0,Yes
349,353,Los Angeles,24,93,91,82,81,443,88.6,Yes
386,390,Los Angeles,25,91,84,83,88,435,87.0,Yes
390,394,Los Angeles,22,92,83,86,87,444,88.8,Yes
418,422,Los Angeles,21,87,100,88,81,440,88.0,Yes

In [46]:
#Find students whose total_marks is above 450 and age <= 23, then sort by total_marks descending.
sorted_students = df.loc[
    (df["total_marks"] > 450) & (df["age"] <= 23)
].sort_values("total_marks", ascending=False)
sorted_students

,student_id,location,age,sql_marks,excel_marks,python_marks,english_marks,total_marks,average_marks,passed
234,238,Toronto,21,93,90,90,97,468,93.6,Yes
255,259,Paris,23,83,98,95,92,468,93.6,Yes
382,386,New York,19,94,91,99,99,468,93.6,Yes
35,39,Melbourne,20,88,99,99,89,467,93.4,Yes
435,439,Berlin,21,92,99,96,88,467,93.4,Yes
383,387,Tokyo,19,93,96,77,98,464,92.8,Yes
362,366,Sydney,19,91,92,90,96,463,92.6,Yes
389,393,Melbourne,18,78,90,97,99,463,92.6,Yes
388,392,Tokyo,20,87,96,89,95,461,92.2,Yes
203,207,Los Angeles,18,95,83,94,100,461,92.2,Yes
159,163,Paris,21,87,95,97,96,460,92.0,Yes
249,253,Melbourne,19,85,99,94,97,460,92.0,Yes
462,466,Toronto,22,97,86,94,99,459,91.8,Yes
257,261,Melbourne,18,83,91,91,99,459,91.8,Yes
119,123,Sydney,23,92,89,83,98,459,91.8,Yes
358,362,Los Angeles,22,100,79,91,100,458,91.6,Yes
116,120,Toronto,20,98,100,87,82,457,91.4,Yes
320,324,Tokyo,19,97,94,90,82,457,91.4,Yes
22,26,Sydney,18,90,91,89,93,457,91.4,Yes
9,13,London,19,97,80,96,86,456,91.2,Yes
486,490,Tokyo,18,87,100,95,85,456,91.2,Yes
6,10,Tokyo,18,77,87,100,93,455,91.0,Yes
154,158,Sydney,23,82,100,100,75,455,91.0,Yes
97,101,Sydney,21,86,90,89,97,455,91.0,Yes
70,74,Paris,22,81,100,78,99,454,90.8,Yes
448,452,London,19,89,96,91,87,454,90.8,Yes
474,478,Tokyo,21,98,89,94,97,453,90.6,Yes
414,418,Sydney,21,84,100,97,73,453,90.6,Yes
254,258,Tokyo,21,80,100,98,75,453,90.6,Yes
133,137,Tokyo,19,79,98,98,82,452,90.4,Yes
251,255,Los Angeles,19,88,83,99,99,451,90.2,Yes
231,235,Melbourne,22,79,90,87,100,451,90.2,Yes
328,332,Toronto,20,95,85,82,94,451,90.2,Yes
393,397,Berlin,21,82,94,81,95,451,90.2,Yes